{"id":"eeca4e385f6a833f3fd63437f","tags":[],"name":"Recharge","type":"Spell","level":"3","traits":"Electricity, Evocation, Technology","actions":"","body":"Traditions arcane, divine, occult\nCast (a) somatic\nRange touch; Targets 1 battery or powered device\n-\nYou attempt to restore power to a battery or a powered device. Declare how many charges you wish to restore and make a skill check based on your spellcasting tradition (Arcana for arcane, Religion for divine and Occultism for occult). The DC for the skill check is dependent on how many charges you declared to restore.\n* **DC 15** - You restore 2 charges.\n* **DC 20** - You restore 1 additional charge to the charges from the DC 15 check.\n* **DC 30** - You restore 2 additional charges to the charges from the DC 15 check.\n* **DC 40** - You restore 3 additional charges to the charges from the DC 15 check.\n\nCritical Success The device regains the charges you declared as well as an extra additional charge up to the maximum capacity the device can withhold.\nSuccess The device regains the charges you declared up to the maximum capacity the device can withhold.\nFailure The device regains 1 charge less than the charges from the DC 15 check up to the maximum capacity the device can withhold.\nCritical Failure The device is overcharged and takes 8d4 electricity damage. This damage ignores hardness. If the target was a battery it is instantly destroyed.\nRegardless of the result, the device becomes immune to further casts of recharge for the next hour; it can still be recharged via batteries or other technological means.\n-\nAttempting to cast this spell on a device that is fully charged automatically critically fails. Recharging batteries via this spell incurs the same chance for destruction as one would recharging it via a generator - on a DC 5 flat check, the battery is destroyed.\n-\nHeightened (+2) The amount of charges you restore on a success from the DC 15 check increases by 1. For example casting the spell at 6th level and declaring you wish to restore 5 charges would be a DC 20 check.","plain":0,"meta":{"public":0,"url":"OPhQClWF"}}